#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```hcl
terraform
tls_private_key.hashicat: Refreshing state... [id=034ead9ed201cc9cc084f9428c37dccdc1b332c3]
aws_key_pair.hashicat: Refreshing state... [id=dev-ssh-key.pem]
aws_vpc.hashicat: Refreshing state... [id=vpc-0f93a53716c7144cf]
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 1s [id=ami-05a5333b72d3d1c93]
aws_internet_gateway.hashicat: Refreshing state... [id=igw-000ff08bd9e98f4a4]
aws_subnet.hashicat: Refreshing state... [id=subnet-0ec7e81b3e07411cc]
aws_security_group.hashicat: Refreshing state... [id=sg-0fa60b696f19a2257]
aws_route_table.hashicat: Refreshing state... [id=rtb-09df0eb870ad20976]
aws_instance.hashicat: Refreshing state... [id=i-091be7ed75a6ad515]
aws_route_table_association.hashicat: Refreshing state... [id=rtbassoc-0581f6d37edcb89e4]
aws_eip.hashicat: Refreshing state... [id=eipalloc-010af6ecefc211ad6]
aws_eip_association.hashicat: Refreshing state... [id=eipassoc-02de37ae5c066a34a]
null_resource.configure-cat-app: Refreshing state... [id=1876799900876465970]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.hashicat has been deleted
  - resource "aws_instance" "hashicat" {
      - id                                   = "i-091be7ed75a6ad515" -> null
        tags                                 = {
            "Name" = "dev-hashicat-instance"
        }
        # (31 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.hashicat will be updated in-place
  ~ resource "aws_eip" "hashicat" {
        id                   = "eipalloc-010af6ecefc211ad6"
      + instance             = (known after apply)
      ~ tags                 = {
          - "Owner" = "tom" -> null
        }
      ~ tags_all             = {
          ~ "Owner"   = "tom" -> "jerry & tom"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_eip_association.hashicat will be created
  + resource "aws_eip_association" "hashicat" {
      + allocation_id        = "eipalloc-010af6ecefc211ad6"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.hashicat will be created
  + resource "aws_instance" "hashicat" {
      + ami                                  = "ami-05a5333b72d3d1c93"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "DEV-ssh-key.pem"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0ec7e81b3e07411cc"
      + tags                                 = {
          + "Name" = "DEV-hashicat-instance"
        }
      + tags_all                             = {
          + "Name"    = "DEV-hashicat-instance"
          + "Owner"   = "jerry & tom"
          + "Project" = "Coffee-Mug-Cake"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.hashicat will be updated in-place
  ~ resource "aws_internet_gateway" "hashicat" {
        id       = "igw-000ff08bd9e98f4a4"
      ~ tags     = {
          ~ "Name"  = "dev-internet-gateway" -> "DEV-internet-gateway"
          - "Owner" = "tom" -> null
        }
      ~ tags_all = {
          ~ "Name"    = "dev-internet-gateway" -> "DEV-internet-gateway"
          ~ "Owner"   = "tom" -> "jerry & tom"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_key_pair.hashicat must be replaced
-/+ resource "aws_key_pair" "hashicat" {
      ~ arn             = "arn:aws:ec2:ap-northeast-2:893651667781:key-pair/dev-ssh-key.pem" -> (known after apply)
      ~ fingerprint     = "9c:e3:1e:58:ac:91:cf:c5:e2:48:72:ee:dd:e8:88:72" -> (known after apply)
      ~ id              = "dev-ssh-key.pem" -> (known after apply)
      ~ key_name        = "dev-ssh-key.pem" -> "DEV-ssh-key.pem" # forces replacement
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-08b1a8eaba2bc623d" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      - tags            = {
          - "Owner" = "tom"
        } -> null
      ~ tags_all        = {
          ~ "Owner"   = "tom" -> "jerry & tom"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.hashicat will be updated in-place
  ~ resource "aws_route_table" "hashicat" {
        id               = "rtb-09df0eb870ad20976"
      ~ tags             = {
          - "Owner" = "tom" -> null
        }
      ~ tags_all         = {
          ~ "Owner"   = "tom" -> "jerry & tom"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.hashicat must be replaced
-/+ resource "aws_security_group" "hashicat" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:893651667781:security-group/sg-0fa60b696f19a2257" -> (known after apply)
      ~ id                     = "sg-0fa60b696f19a2257" -> (known after apply)
      ~ name                   = "dev-security-group" -> "DEV-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "893651667781" -> (known after apply)
      ~ tags                   = {
          ~ "Name"  = "dev-security-group" -> "DEV-security-group"
          - "Owner" = "tom" -> null
        }
      ~ tags_all               = {
          ~ "Name"    = "dev-security-group" -> "DEV-security-group"
          ~ "Owner"   = "tom" -> "jerry & tom"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_subnet.hashicat will be updated in-place
  ~ resource "aws_subnet" "hashicat" {
        id                                             = "subnet-0ec7e81b3e07411cc"
      ~ tags                                           = {
          - "Owner" = "tom" -> null
          ~ "name"  = "dev-subnet" -> "DEV-subnet"
        }
      ~ tags_all                                       = {
          ~ "Owner"   = "tom" -> "jerry & tom"
          ~ "name"    = "dev-subnet" -> "DEV-subnet"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc.hashicat will be updated in-place
  ~ resource "aws_vpc" "hashicat" {
        id                                   = "vpc-0f93a53716c7144cf"
      ~ tags                                 = {
          - "Owner"       = "tom" -> null
          ~ "name"        = "dev-vpc-ap-northeast-2" -> "DEV-vpc-ap-northeast-2"
            # (1 unchanged element hidden)
        }
      ~ tags_all                             = {
          ~ "Owner"       = "tom" -> "jerry & tom"
          ~ "name"        = "dev-vpc-ap-northeast-2" -> "DEV-vpc-ap-northeast-2"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
**Pusher**: @Jaeyoon32
**Action**: pull_request
